import pandas as pd

print('----' * 30)
print('Информация о классах')

class_card = {
    'Предмет': ['Математика', 'Литература', 'Английский', 'Французский', 'Информатика'],
    'Номер парты': ['1', '2', '3', '4', '5'],
    'Ряд': ['Первый', 'Второй', 'Третий', 'Четвертый', 'Пятый'],
    'Вид парты': ['Двуместная', 'Двуместная', 'Двуместная ', 'Двуместная ', 'Двуместная'],
    'ID': ['01', '02', '03', '04', '05']
}

cc = pd.DataFrame(data=class_card)

with open('class.csv', 'a', encoding='UTF-8') as cl:
    cl.write(f'{cc}')
    cl.write('\n')
