import pandas as pd

print('----' * 30)
print('Данные об учениках класса 11 А в гимназии  # 2023')

stud_card = {
    'ID': ['01', '02', '03', '04', '05'],
    'Имя': ['Иван', 'Петр', 'Сергей', 'Сидор', 'Афанасий'],
    'Фамилия': ['Иванов', 'Петров', 'Сергеев', 'Сидоров', 'Афанасьев'],
    'Дата рождения': ['01.01.2006', '02.02.2006', '03.03.2006', '04.04.2006', '05.05.2006'],
    'Успеваемость': ['Отличник', 'Отличник', 'Отличник', 'Отличник', 'Отличник']
}

sc = pd.DataFrame(data=stud_card)

with open('pupil.csv', 'a', encoding='UTF-8') as cl:
    cl.write(f'{sc}')
    cl.write('\n')

print(sc)